init python:
    mp = MultiPersistent("MLDWY")   #Инкапсуляция        #Этот класс позвляет сохранить данные из одного проекта
                                                         #посредством ключа "MLDWY". Это ключ можно использовать в другом проекте,
                                                         #который должен выступать продолжением или наследником.

                                                #Иными словами это подтверждение того, что пользователь закончил прохождение игры.

                                                #Во всех других случаях, если ключ не внедрен, то пользователь не прошел игру.

default said_true = False
label start:




    scene bg tardis with dissolve


    play music "music/mtheme_2.mp3" fadein 1 fadeout 1

    teach "Який градус відхилення від пункту призначення?"
    hide teach

    r "36.250498900000004 Довготи."
    teach "А широта?"

    hide teach

    r "Широта 50.0063634."

    r "Ааа! .. Ми скоро провалимося в чорну діру!"

    r "Швидше, потрібно зробити що-небудь!"



    teach """
        Що я по-твоєму повинен зробити в подібній ситуації?

        Давай спробую сказати їй, щоб вона сдвінуалсь з нашого шляху.

        Гей! Ти, величезна чорна штука! Ну-ка, геть звідси, ти лякаєш мого асісстента!

        ...

        ...

        Хтось правда подумав, що це допоможе?

    """

    r """

        Як ти можеш жартувати в такий момент? Ми ж ось-ось загинемо тут!

        Далеко від наших рідних і друзів.

        ...

    У мене є ідея. І тільки за допомогою тебе я зможу врятувати нас.

        ...

        Я звертаюся до тебе, читачу.

        Поки що ми повинні з тобою зробити це разом, а Капітан нехай намагається зв'язатися з ким-то, хто є поблизу.

    """
    scene bg tardis_ins with dissolve
    show t say at right with dissolve
    show r neutral at left with dissolve

    m """
        З ким Капітан збирається зв'язатися, якщо ми знаходимося незрозуміло де?

    """
    hide t say with dissolve

    show r neutral_2 at center with dissolve

    r """
        Для початку пройдемося по теорії.

        Це допоможе тобі і мені прийняти вірне рішення.

        Інформація - це відображення реального (матеріального) світу у вигляді знаків і сигналів.

    """

    m """
        Добре, раз ці знання знадобляться мені на практиці, то краще їх запам'ятати.

    """

    r """
        Вірно мислиш, тоді продовжимо.

        Інформаційні процеси - це процеси пошуку та накопичення, обробки та використання, подання, зберігання і захисту інформації.
    """

    m """
    Що це?


        Я відчуваю як шкала моєї сили Мозковий штурм заповнюється з кожним новим поняттям!

        Саме так почуваються супергерої, коли після чергового спійманого злочинця збираються поїсти піци?

    """
    r """
        Не зовсім ... Але припустимо!

        Наступне, що нам знадобиться так це Повідомлення.

        Це послідовність сигналів різної природи (звук, текст, зображення, жести, електричні сигнали і т.д.).

        Дані - це повідомлення, зафіксовані на носіях (інформації).

        Повідомлення можуть передавати від людини до людини, від людини до пристрою і навпаки, а також між пристроями.

        Між людьми повідомлення передають в усній або письмовій формі, а між пристроями - за допомогою електро-магнітних сигналів.

        Інформація залежить від того, як розуміється повідомлення, за допомогою якого її передають.

        І те, що стане вирішальним у нашому спасінні - Кодування.

        Кодування - це процес заміни знаків одного набору знаками іншого набору при збереженні змісту інформації, яку подають за допомогою цих знаків.
    """
    m """
        О, а я знаю, що таке Декодування!

        Декодування - це процес, зворотний кодування.
    """

    r """
        Дуже добре-
    """

    teach """
        Асисстент! Ми отримали повідомлення від невідомого джерела!

        Що за ... Тут якісь каракулі. Нічого не розумію!

        Поглянь на це, швидше.
    """

    r """
        Що тут у тебе відбувається? О-ох ... Це кодування ... Схоже на Кодування Цезаря.
    """

    m """
        Може мені хтось пояснити, що тут відбувається? Що таке Кодування Цезаря?

    """
    r """
        Кодування Цезаря це дуже цікава річ.

        Шифр Цезаря - це вид шифру підстановки, в якому кожен символ у відкритому тексті замінюється символом, що знаходяться на деякій постійній числі позицій ліворуч або праворуч нього в алфавіті.

        Давай подивимося, що тут написано ...

        ROT1: Лмяш л трбтёойя - юуп 1.048596 й 2.195013.

        Зможеш розшифрувати?

        """

    m   """
        Э-эээ? Я?
        Добре, я спробую...

        """



    menu:
            "Яка версія декодування буде вважатися правильною? Від цього залежить: спасетесь ви або загинете!"

            "Ключ до порятунку - це 1.048596 і 2.195013 ":
                jump true

            "Відповідь і порятунок - тут 2.159607 до 3.206124":
                jump false


            "Тут і тут - від 1.048596 до 2.195013":
                jump false
label false:
    teach """
    Бачите ці координати?

    Потрібно ввести їх в бортовий комп'ютер.
    ...
    ...


    """

    n """
        Розпізнані координати довготи 2.159607 і широти 3.206124.

        Зчитую дані ...

        ...
        ...

        Знайдені дані належать Системі Темного Сонця 45T8W12CVB. Планета Бінгус.

        Запускаю протоколи рятувальних систем ...

        Приготуватися до відправки через 3 ... 2 ... 1 ...

        Увага! На планеті виявлені небезпечні істоти нагадують котів.

        Пропозиція: будьте обережні.

        ...

    """

    scene bg tardis_dead with dissolve

    teach "Ну, ми хоча б залишилися живі."

    teach "Мабудь, розшифровка была незовсім корректной."

jump end

label true:
    teach """
    Бачите ці координати?

    Потрібно ввести їх в бортовий комп'ютер.
    ...
    ...


    """

    n """
        Розпізнані координати довготи 1.048596 і широти 2.195013.

        Зчитую дані ...

        ...
        ...

        Знайдені дані належать Сонячній Системі 3F51S8ER778, простіше кажучи планети Землі.

        Запускаю протоколи рятувальних систем ...

        Приготуватися до відправки через 3 ... 2 ... 1 ...
    """
    scene bg black with dissolve

    show r neutral_2 at center with dissolve

    r """
        ...

        От і все. Спасибі тобі, що допоміг нам врятуватися. Без тебе ми б ...

        Навіть подумати страшно, що б сталося з нами, якби не твої знання.

        Так що, спасибі тобі за все, а тепер нам пора, на Землю ...
        """

    scene bg tardis_earth with dissolve

label end:
    r "Кінец!"
